{"meta":{"title":"Title TK","description":"Description tk."},"body":[{"section":"intro","content":[{"type":"Hero","value":{"big":"You<br>will<br>die","small":"someday."}},{"type":"text","value":"<span class=emoji>👻</span>"},{"type":"text","value":"<span class=center>Probably not today.</span>"},{"type":"text","value":"Would you believe me if I told you that you’re actually <strong>more likely to die on your birthday</strong> than on other days of the year?"},{"type":"text","value":"This statistical curiosity is called the <strong>birthday effect</strong>."},{"type":"text","value":"There have been a bunch of <a href=https://en.wikipedia.org/wiki/Birthday_effect target=_blank rel=noreferrer>studies</a> on different populations that have proven that it’s real."},{"type":"text","value":"But I was skeptical (maybe you are too?), so let’s run our own study to understand how–and if–it works."},{"type":"text","value":"<span class=emoji>🧑‍🔬</span>"}]},{"section":"basic","content":[{"type":"text","value":"<strong class=big>The question:</strong>"},{"type":"text","value":"<strong>Do more people die on their birthdays than expected?</strong>"},{"type":"text","value":"I live in Massachusetts, so I got data on the 68,453 people who died in 2020."},{"type":"text","value":"The first thing we can do is count the number of days a person dies before or after their birthday on a circular calendar."},{"type":"text","value":"We’ll start with Gus (made up name), who was born on March 4th, and after 84 years, died on March 4th. That’s a 0 day difference."},{"type":"text","value":"Two more examples: Gretchen, who was born on May 11th and died on May 2nd–a -9 day difference. And Randall who was also born on May 11th, but died on August 7th–an 87 day difference."},{"type":"img","value":{"src":"assets/sketches/explain@2x.png","alt":"Tk","loading":"lazy"}},{"type":"text","value":"You get the picture. We arrange their relative death dates from -182 to 182 (days before and after birthday, respectively)."},{"type":"img","value":{"src":"assets/sketches/explain2@2x.png","alt":"Tk","loading":"lazy"}},{"type":"text","value":"We do this for each person and count the number of times each difference occurs. If we expect death dates to be random relative to birthdays, this should look pretty flat. Instead, we can see some variation. Interesting…"},{"type":"img","value":{"src":"assets/sketches/all@2x.png","alt":"Tk","loading":"lazy"}},{"type":"text","value":"But what we care about most is how many observations are on the zero day difference. Is it bigger? <strong>Enhance!</strong>"},{"type":"img","value":{"src":"assets/sketches/enhance@2x.png","alt":"Tk","loading":"lazy"}},{"type":"text","value":"There are <strong>17% excess birthday deaths</strong> compared to the average day difference."},{"type":"text","value":"We did it, we found the birthday effect!"}]},{"section":"sample","content":[{"type":"text","value":"<strong class=big>But…</strong>"},{"type":"text","value":"Look at this. Did you notice that just four days before birthdays it is even higher? Does that mean there is an “Four-days-before-a birthday effect”, too?"},{"type":"img","value":{"src":"assets/sketches/other.jpg","alt":"Tk","loading":"lazy"}},{"type":"text","value":"Maybe. But we’re likely facing a sample size issue here. Imagine trying to figure out if a coin is rigged towards landing on heads by flipping it just 10 times. You might get six heads and four tails, but that doesn’t prove much. You need more tests.The same thing is happening with our data."},{"type":"text","value":"We’re trying to detect if one specific value out of 365 is special. 68,453 observations might seem like a lot, but when you spread that over 365 days, we only expect about 188 deaths on any given day. But we expect some natural variation due to random chance since this is real life."},{"type":"text","value":"Statistics tells us the standard deviation would be about 14. In practice, this means we’d expect many (68%) of our observations to fall between 174-202 deaths (one standard deviation), and most (95%) to fall between 160-216 deaths (two standard deviations) – even if there’s no birthday effect at all."},{"type":"img","value":{"src":"assets/sketches/sorted.jpg","alt":"Tk","loading":"lazy"}},{"type":"text","value":"This natural variation in the data makes it hard to spot subtle patterns. We need a large enough sample to see if that birthday spike is truly meaningful or just random noise."},{"type":"text","value":"So I got data of every person who died in Massachusetts from 1990-2024. When we look at more years, we can see the noise factor play out. Some years, like 1999, will show a strong birthday effect."},{"type":"img","value":{"src":"assets/sketches/all.jpg","alt":"Tk","loading":"lazy"}},{"type":"text","value":"While other years, like 2002, might show nothing at all."},{"type":"img","value":{"src":"assets/sketches/all.jpg","alt":"Tk","loading":"lazy"}},{"type":"text","value":"But if we combine all 35 years I have (1990-2024), with nearly 2 million observations–5,358 per date–random fluctuations start to cancel out. This improves our ability to be more confident in our findings."},{"type":"img","value":{"src":"assets/sketches/zero.jpg","alt":"Tk","loading":"lazy"}},{"type":"text","value":"Now we see 6.9% excess birthday deaths. This is more promising."}]},{"section":"significance","content":[{"type":"text","value":"<strong class=big>But…</strong>"},{"type":"text","value":"How confident can we be that our results are <strong>statistically significant,</strong> and how do we measure this?"},{"type":"text","value":"Z-Tests and p-values baby!"},{"type":"text","value":"To test significance, we start with the <strong>null hypothesis:</strong>"},{"type":"blockquote","value":"“There is no birthday effect. Deaths occur randomly throughout the year regardless of birthdays.”"},{"type":"text","value":"Then we ask ourselves, how likely would we see this birthday spike by pure chance alone if our null hypothesis were true?"},{"type":"text","value":"We calculate a z-score by taking the difference between observed and expected birthday deaths, then dividing by the standard deviation:"},{"type":"code","value":"z = (observed - expected) / standard deviation"},{"type":"text","value":"With 1,955,588 observations, we get a z-score of 5, which is extreme in the statistics world."},{"type":"text","value":"(to do visually explain this stuff more)"},{"type":"text","value":"Converting this to a <strong>p-value</strong> tells us the probability of seeing this pattern if the null hypothesis were true."},{"type":"text","value":"Our p-value is ~0.000001, meaning there’s less than a 0.0001% chance we’d see this birthday effect if deaths were truly random."},{"type":"img","value":{"src":"assets/chance.jpg","loading":"lazy","alt":"screenshot from Dumb and Dumber “you’re telling me there’s a chance”"}},{"type":"text","value":"Statisticians typically consider any p-value below 0.05 to be significant enough to reject the null hypothesis, and we’re <strong>way</strong> below that threshold."},{"type":"text","value":"Therefore, the birthday effect is real (and statistically significant)!"}]},{"section":"seasonality","content":[{"type":"text","value":"<strong class=big>But…</strong>"},{"type":"text","value":"(*sighs* coming from you)"},{"type":"text","value":"Births and deaths aren’t evenly spread throughout the year. Winter months see more deaths from flu and cold weather, while birth patterns have their own seasonal rhythm."},{"type":"text","value":"If we look at births and deaths by month, we see clear patterns:"},{"type":"img","value":{"src":"assets/sketches/season.jpg","alt":"Tk","loading":"lazy"}},{"type":"text","value":"Take January in Massachusetts: 8.5% of people are born then, but 9.6% of all deaths happen in January. This means January-born people would naturally show <strong>13% more birthday deaths</strong> just because January is a high-mortality month—regardless of some birthday effect."},{"type":"code","value":"9.6% ÷ 8.5% = <strong>1.13</strong>"},{"type":"text","value":"To find a true birthday effect, we need to adjust for these seasonal patterns. Otherwise, we’re just measuring when people tend to die anyway."},{"type":"text","value":"(todo- way more here about the grid approach)"},{"type":"text","value":"This means we can definitively say there is <strong>still</strong> an effect that has nothing to do with seasonal factors, but rather, ✨something else. ✨"}]},{"section":"theories","content":[{"type":"text","value":"<strong class=big>But…</strong>"},{"type":"text","value":"(this is still being fleshed out, kind of a jumble)"},{"type":"text","value":"What does it all mean? Why <strong>is</strong> there a birthday effect?"},{"type":"text","value":"Some theories…"},{"type":"text","value":"behavior (alcohol consumption,risk-taking behaviors)"},{"type":"text","value":"psychological factors: (anticipatory effect, anniversary reaction)"},{"type":"text","value":"So we can go deeper…who is most affected?"}]},{"section":"more","content":[{"type":"text","value":"But that is just the birthday, if there is some reason around the day, maybe the precise day isn’t the only thing worth looking at …"},{"type":"text","value":"before/after effect (death postponement vs. anniversary reaction)"},{"type":"text","value":"Age differences: Show how effect size varies by age group"},{"type":"text","value":"Gender differences: Do men and women show different patterns?"},{"type":"text","value":"Maybe other stuff (weekday/weekend, cause of death)"}]},{"section":"comparison","content":[{"type":"text","value":"Comparison to other studies (or should happen inline?)"}]},{"section":"conclusion","content":[{"type":"text","value":"<strong class=big>So what have we learned?</strong>"},{"type":"text","value":"The birthday effect shows that mortality isn’t just about biology and random chance; it’s influenced by social constructs and personal significance."},{"type":"text","value":"In a broader sense, this research reminds us that data can reveal hidden patterns in human experience that we might otherwise miss."},{"type":"text","value":"Also, asking questions of data is part science, part art. How you ask the questions is just as important as what you ask."}]},{"section":"method","content":[{"type":"text","value":"Data excludes deaths with age under 1.5 and leap years on for both birthdays and in calculations."},{"type":"text","value":"Caveats…simplified a lot of things. Lot’s of different approaches."}]}]}