{"meta":{"title":"Title TK","description":"Description tk."},"body":[{"section":"intro","content":[{"type":"Hero","value":{"big":"You<br>will<br>die","small":"someday."}},{"type":"text","value":"<span class=emoji>👻</span>"},{"type":"text","value":"<span class=center>Probably not today.</span>"},{"type":"text","value":"Would you believe me if I told you that you’re actually <strong>more likely to die on your birthday</strong> than on other days of the year?"},{"type":"text","value":"This statistical curiosity is called the <strong>birthday effect</strong>."},{"type":"text","value":"There have been a bunch of <a href=https://en.wikipedia.org/wiki/Birthday_effect target=_blank rel=noreferrer>studies</a> on different populations that have proven that it’s real."},{"type":"text","value":"But I was skeptical (maybe you are too?), so let’s run our own study to understand how–and if–it works."},{"type":"text","value":"<span class=emoji>🧑‍🔬</span>"}]},{"section":"basic","content":[{"type":"text","value":"The basic question we want to answer: <strong>do more people die on their birthdays than expected?</strong>"},{"type":"text","value":"I live in Massachusetts, so I got data on the 57,230 people (over the age of one) that died in 2000."},{"type":"text","value":"We expect to see <strong>157 deaths</strong> on any given day."},{"type":"code","value":"57,230 deaths ÷ 365.25 days = <strong>~157</strong>"},{"type":"text","value":"In 2024, <strong>184 people</strong> died on their birthday."},{"type":"text","value":"This means there were <strong>17% excess deaths</strong> on birthdays."},{"type":"code","value":"184 (observed) ÷ 157 (expected) = <strong>1.17</strong>"},{"type":"text","value":"We did it, we found the birthday effect."},{"type":"text","value":"<span class=emoji>✅</span>"}]},{"section":"seasonality","content":[{"type":"text","value":"<strong class=big>But…</strong>"},{"type":"text","value":"Births and deaths aren’t evenly spread throughout the year. Winter months see more deaths from flu and cold weather, while birth patterns have their own seasonal rhythm."},{"type":"text","value":"If we look at births and deaths by month, we see clear patterns:"},{"type":"text","value":"(chart showing births/deaths by month)"},{"type":"text","value":"Take January in Massachusetts: 8.5% of people are born then, but 10.4% of all deaths happen in January. This means January-born people would naturally show <strong>22% more birthday deaths</strong> just because January is a high-mortality month—regardless of some birthday effect."},{"type":"code","value":"10.4% ÷ 8.5% = <strong>1.22</strong>"},{"type":"text","value":"To find a true birthday effect, we need to adjust for these seasonal patterns. Otherwise, we're just measuring when people tend to die anyway."},{"type":"text","value":"To eliminate any seasonal effect, we could compare birth and death dates in a circular year (for simplicity, we’ll exclude leap days)."},{"type":"text","value":"(graphic below)"},{"type":"text","value":"Here is Gus (made up name). He was born and died on May 11 (real dates). That’s a difference of 0 days."},{"type":"text","value":"Next is Gretchen. She was born on March 2, and died on April 13. That’s a difference of 43 days."},{"type":"text","value":"Last is Randall. He was also born on March 2, and died a day before his birthday–March 1. That’s a difference of -1."},{"type":"text","value":"We do this for each person and count the number of times each difference occurs. We arrange them in sequence from -182 to 182 (days before and after birthday, respectively)."},{"type":"text","value":"(chart)"},{"type":"text","value":"If we expect death dates to be random relative to birthdays, this should look pretty flat."},{"type":"text","value":"(plot relative days)"},{"type":"text","value":"What we actually see has a bit more variety. So now when we compare observations against expectations after controlling for seasonality, we see XX% excess deaths."},{"type":"text","value":"This means we can definitively say there is <strong>still</strong> an effect that has nothing to do with seasonal factors, but rather, ✨something else. ✨"}]},{"section":"sample","content":[{"type":"text","value":"<strong class=big>But…</strong>"},{"type":"text","value":"How can we be certain it is <strong>statistically significant</strong>, not just random chance or noisy data?"},{"type":"text","value":"Because look, did you notice X days before also looked a little high? Where do we draw the line?"},{"type":"text","value":"There are two pieces to this puzzle; variance and confidence. 57k people might seem like a lot, but when you distribute over 365 days, it’s not a ton of data for each possibility. A more dramatic example, if you flipped a coin and got heads 4 out of 5 times, you aren’t going to start claiming that you flip heads 80% of the time."},{"type":"text","value":"Let’s look at every other year independently to see what the rates are…"},{"type":"text","value":"Demonstrate how confidence intervals narrow with larger samples."},{"type":"text","value":"If we combine them all, we get way more values for each day, which gives us lower variance, so we can be even more confident in our findings."}]},{"section":"significance","content":[{"type":"text","value":"<strong class=big>But…</strong>"},{"type":"text","value":"How confident can we be that our results are significant, and how do we measure this?"},{"type":"text","value":"Z-Tests and p-values baby!"},{"type":"text","value":"Demonstrate significance testing on our dataset (and variations of samples)"},{"type":"text","value":"p-value means that chance it’s not random (1 in 1 million, there’s still a chance!)"},{"type":"text","value":"Reveal - The birthday effect is statistically significant!"}]},{"section":"theories","content":[{"type":"text","value":"Some theories why it exists:"},{"type":"text","value":"behavior (alcohol consumption ,risk-taking behaviors)"},{"type":"text","value":"psychological factors: (Stress of milestone events, anniversary reaction)"},{"type":"text","value":"So we can go deeper…who is most affected?"}]},{"section":"more","content":[{"type":"text","value":"But that is just the birthday, if there is some reason around the day, maybe the precise day isn’t the only thing worth looking at …"},{"type":"text","value":"before/after effect (death postponement vs. mortality mirror)"},{"type":"text","value":"Age differences: Show how effect size varies by age group"},{"type":"text","value":"Gender differences: Do men and women show different patterns?"},{"type":"text","value":"Maybe other stuff (weekday/weekend, cause of death)"}]},{"section":"comparison","content":[{"type":"text","value":"Comparison to other studies (or should happen inline?)"}]},{"section":"conclusion","content":[{"type":"text","value":"The birthday effect shows that mortality isn't just about biology and random chance; it's influenced by social constructs and personal significance. In a broader sense, this research reminds us that data can reveal hidden patterns in human experience that we might otherwise miss."}]}]}