{"meta":{"title":"Are you more likely to die on your birthday?","description":"Yes. We’ll run a study to show you how, and why."},"body":[{"section":"intro","content":[{"type":"Hero","value":{"big":"You<br>will<br>die","small":"someday."}},{"type":"img","value":{"src":"assets/sketches/ghost@2x.webp","alt":"tk","class":"emoji"}},{"type":"text","value":"<span class=center>Probably not today.</span>"},{"type":"text","value":"Would you believe me if I told you that you’re actually <strong>more likely to die on your birthday</strong> than on other days of the year?"},{"type":"text","value":"This statistical curiosity is called the <strong>birthday effect</strong>."},{"type":"text","value":"There have been a bunch of <a href=https://en.wikipedia.org/wiki/Birthday_effect target=_blank rel=noreferrer>studies</a> on different populations that have proven that it’s real."},{"type":"text","value":"But I was skeptical (maybe you are too?), so let’s run our own study to understand how–and if–it works."},{"type":"img","value":{"src":"assets/sketches/tube@2x.webp","alt":"tk","class":"emoji"}}]},{"section":"basic","content":[{"type":"text","value":"<strong class=big>The question:</strong>"},{"type":"text","value":"<strong>Do more people die on their birthdays than expected?</strong>"},{"type":"text","value":"I live in Massachusetts, so I got data on the 57,010 people who died back in the year 2000."},{"type":"text","value":"The first thing we can do is count the number of days a person dies before or after their birthday on a circular calendar.*"},{"type":"text","value":"We’ll start with Gus (made up name), who was born on March 4th, and after 84 years, died on March 4th. <strong>That’s a 0 day difference.</strong>"},{"type":"text","value":"Two more examples: Gretchen, who was born on May 11th and died on May 2nd–a -9 day difference. And Randall who was also born on May 11th, but died on August 7th–an 87 day difference."},{"type":"img","value":{"src":"assets/sketches/explain@2x.webp","alt":"Tk","loading":"lazy"}},{"type":"text","value":"You get the picture. We arrange their relative death dates from -182 to 182 (days before and after birthday, respectively)."},{"type":"img","value":{"src":"assets/sketches/explain2@2x.webp","alt":"Tk","loading":"lazy"}},{"type":"text","value":"We do this for each person and count the number of times each difference occurs. If we expect death dates to be random relative to birthdays, this should look pretty flat. Instead, we can see variation."},{"type":"img","value":{"src":"assets/sketches/all-2000@2x.webp","alt":"Tk","loading":"lazy"}},{"type":"text","value":"Interesting…But what we care about most is how many observations are on the zero day difference. Is there a spike? <strong>Enhance!</strong>"},{"type":"img","value":{"src":"assets/sketches/enhance@2x.webp","alt":"Tk","loading":"lazy"}},{"type":"text","value":"There are <strong>17% excess birthday deaths</strong> compared to the average day difference."},{"type":"text","value":"We did it, we found the birthday effect!"}]},{"section":"sample","content":[{"type":"text","value":"<strong class=big>But…</strong>"},{"type":"text","value":"Look at this. Did you notice that just 12 days after birthday deaths is nearly as high? Does that mean there is a “12-days-after-a-birthday effect,” too?"},{"type":"img","value":{"src":"assets/sketches/other@2x.webp","alt":"Tk","loading":"lazy"}},{"type":"text","value":"Maybe. But this could be a <strong>sample size problem.</strong> It’s like trying to detect a rigged coin with just 10 flips. Getting six heads instead of the expected five wouldn’t prove much–you need more tests. The same applies to our data."},{"type":"text","value":"57,010 observations might seem like a lot, but not when you spread them over 365 days."},{"type":"text","value":"And there will always be some natural variation due to random chance since this is real life. So, <strong>is the zero day difference due to random chance or not?</strong> To answer this, we need to first know how much the data vary from the average. We start by figuring out how spread out the data is."},{"type":"text","value":"Here are all day differences sorted by magnitude. You can see that birthdays (day difference = 0) have one of the highest death frequencies."},{"type":"img","value":{"src":"assets/sketches/sorted@2x.webp","alt":"Tk","loading":"lazy"}},{"type":"text","value":"To see the broader trend, let’s group our day difference values into buckets of five. In the chart above, there are <strong>eight day differences with values between 180-185</strong>, including birthday deaths. That makes up one bucket. We tally up the count for all other buckets, and get the histogram below."},{"type":"img","value":{"src":"assets/sketches/histogram@2x.webp","alt":"Tk","loading":"lazy"}},{"type":"text","value":"You’ll notice a balanced-looking, slight bell shape–this is important. It is called a <strong>normal distribution</strong> or “bell curve.”"},{"type":"text","value":"If we measure the spread,  we find that many values–about 68%–fall within a certain range (+/- 13) of the average (156 deaths). This range (143-169) is what statisticians call <strong>one standard deviation.</strong>"},{"type":"text","value":"This 68% pattern is a key feature of bell curves–<a href=https://en.wikipedia.org/wiki/68%E2%80%9395%E2%80%9399.7_rule target=_blank rel=noreferrer>a mathematical rule</a> that shows up everywhere in nature and statistics."},{"type":"img","value":{"src":"assets/sketches/stddev@2x.webp","alt":"Tk","loading":"lazy"}},{"type":"text","value":"We expect most (95%) values to fall within two standard deviations. That means anything from 130-182 is normal variation–expected random noise in our data. Birthday deaths a hair higher, at just over 2 standard deviations."},{"type":"text","value":"This normal variation in the data makes it hard to spot subtle patterns–like the birthday effect. We need a large enough sample to see if that birthday spike is truly meaningful or just random noise."},{"type":"text","value":"So I got data of every person who died in Massachusetts from 1990-2024. When we look at more years, we can see the noise factor play out more clearly. Some years, like 1999, will show a strong birthday effect."},{"type":"img","value":{"src":"assets/sketches/all-1999@2x.webp","alt":"Tk","loading":"lazy"}},{"type":"text","value":"While other years, like 2002, might show nothing at all."},{"type":"img","value":{"src":"assets/sketches/all-2002@2x.webp","alt":"Tk","loading":"lazy"}},{"type":"text","value":"But if we combine all 35 years I have (1990-2024), with nearly 2 million observations–5,358 per day difference–random fluctuations start to cancel out. This improves our ability to be more confident in our findings."},{"type":"img","value":{"src":"assets/sketches/all@2x.webp","alt":"Tk","loading":"lazy"}},{"type":"text","value":"For good measure, let’s enhance this too."},{"type":"img","value":{"src":"assets/sketches/enhance-all@2x.webp","alt":"Tk","loading":"lazy"}},{"type":"text","value":"Now we see <strong>6.9% excess deaths</strong> on birthdays. This is more promising."}]},{"section":"significance","content":[{"type":"text","value":"<strong class=big>But…</strong>"},{"type":"text","value":"How confident can we be that our results are <strong>statistically significant,</strong> and how do we measure this?"},{"type":"text","value":"Z-Tests and p-values baby!"},{"type":"img","value":{"src":"assets/chalkboard.webp","loading":"lazy","alt":"screenshot from A Beautiful Mind of a person and a chalkboard"}},{"type":"text","value":"To test significance, we start with the <strong>null hypothesis</strong>–we assume there is nothing special happening here. In our case:"},{"type":"blockquote","value":"“There is no birthday effect. Deaths occur randomly throughout the year regardless of birthdays.”"},{"type":"text","value":"Then we ask ourselves, how likely would we see this birthday spike by pure chance alone if our null hypothesis were true?"},{"type":"text","value":"We just need three ingredients to calculate a z-score: observed deaths, expected deaths, and the standard deviation. Hey! We know all about that now, so we can put it to use."},{"type":"code","value":"(observed - expected) / std. dev. = z-score"},{"type":"text","value":"Plugging in the values from our 1,955,588 observations:"},{"type":"code","value":"(5,728 - 5,358) / 74 = 5"},{"type":"text","value":"Our <strong>z-score of 5</strong> is incredibly strong, which tells us this is well beyond normal variation."},{"type":"text","value":"Converting this to a <strong>p-value</strong> tells us the probability of seeing this extreme result, if the null hypothesis were true and there was no birthday effect."},{"type":"text","value":"Our p-value is ~0.000001, meaning there’s less than a 0.0001% chance we’d see this birthday effect if deaths were actually random."},{"type":"img","value":{"src":"assets/chance.webp","loading":"lazy","alt":"screenshot from Dumb and Dumber “you’re telling me there’s a chance”"}},{"type":"text","value":"Since that chance is so low, it is a near-certainty that this isn’t due to normal variation. Statisticians typically consider any p-value below 0.05 to be significant enough to reject the null hypothesis, and we’re <strong>way</strong> below that threshold."},{"type":"text","value":"Therefore, the birthday effect is real (and statistically significant)!"}]},{"section":"seasonality","content":[{"type":"text","value":"<strong class=big>But…</strong>"},{"type":"text","value":"(*sighs* coming from you)"},{"type":"text","value":"Births and deaths aren’t evenly spread throughout the year. Winter months see more deaths from flu and cold weather, while birth patterns have their own seasonal rhythm."},{"type":"img","value":{"src":"assets/sketches/months@2x.webp","alt":"Tk","loading":"lazy"}},{"type":"text","value":"Take January in Massachusetts: 8.5% of people are born then, but 9.6% of all deaths happen in January. This means January-born people would naturally show <strong>13% more birthday deaths</strong> just because January is a high-mortality month—regardless of some birthday effect."},{"type":"code","value":"9.6% ÷ 8.5% = <strong>1.13</strong>"},{"type":"text","value":"To find a true birthday effect, we need to adjust for these seasonal patterns. Otherwise, we’re just measuring when people tend to die anyway."},{"type":"text","value":"<strong>END OF WHERE I’VE GOTTEN TO</strong>"},{"type":"text","value":"todo all the seasonality stuff here…"},{"type":"text","value":"This means we can definitively say there is <strong>still</strong> an effect that has nothing to do with seasonal factors, but rather, ✨something else. ✨"}]},{"section":"theories","content":[{"type":"text","value":"<strong class=big>But…</strong>"},{"type":"text","value":"(this is still being fleshed out, kind of a jumble)"},{"type":"text","value":"What does it all mean? Why <strong>is</strong> there a birthday effect?"},{"type":"text","value":"Some theories…"},{"type":"text","value":"behavior (alcohol consumption,risk-taking behaviors)"},{"type":"text","value":"psychological factors: (anticipatory effect, anniversary reaction)"},{"type":"text","value":"So we can go deeper…who is most affected?"}]},{"section":"more","content":[{"type":"text","value":"But that is just the birthday, if there is some reason around the day, maybe the precise day isn’t the only thing worth looking at …"},{"type":"text","value":"before/after effect (death postponement vs. anniversary reaction)"},{"type":"text","value":"Age differences: Show how effect size varies by age group"},{"type":"text","value":"Gender differences: Do men and women show different patterns?"},{"type":"text","value":"Maybe other stuff (weekday/weekend, cause of death)"}]},{"section":"comparison","content":[{"type":"text","value":"Comparison to other studies (or should happen inline?)"}]},{"section":"conclusion","content":[{"type":"text","value":"<strong class=big>So what have we learned?</strong>"},{"type":"text","value":"The birthday effect shows that mortality isn’t just about biology and random chance; it’s influenced by social constructs and personal significance."},{"type":"text","value":"In a broader sense, this research reminds us that data can reveal hidden patterns in human experience that we might otherwise miss."},{"type":"text","value":"Also, asking questions of data is part science, part art. How you ask the questions is just as important as what you ask."}]},{"section":"method","content":[{"type":"text","value":"Data excludes deaths with age under 1.5 and leap years on for both birthdays and in calculations."},{"type":"text","value":"Caveats…simplified a lot of things. Lot’s of different approaches."}]}]}